//code.oa.gg/java8/949
// 문제 : 아래 코드의 잘 못된 점을 고쳐보세요.[정답]

class Main {
    public static void main(String[] args) {

        사람 a사람1 = new 사람();
        a사람1.이름 = "홍길동";
        a사람1.나이 = 22;

        a사람1.자기소개();
        // 출력 : 저는 22살 홍길동 입니다.

        사람 a사람2 = new 사람();
        a사람2.이름 = "홍길순";
        a사람2.나이 = 25;

        a사람2.자기소개();
        // 출력 : 저는 25살 홍길순 입니다.

        a사람1.자기소개();
        // 출력 : 저는 22살 홍길동 입니다.
    }
}

// 본사직원은 오직 본사직원 끼리만 소통가능!!!
// 대리점은, 본인대리점과, 본사까지 소통가능
class 사람 {
    int 나이; // 본사: 나대리
    String 이름; // 본사: 이과장

    // 대리점 : 자부장
    void 자기소개() {
        System.out.println("저는 " + 나이 + "살 " + 이름 + " 입니다.");
    }
}